import React, { Fragment, useState } from 'react';

import { CardMain } from './CardMain';

const CardHolder = () => {
    const [CardList, setCardList] = useState([
        {title:'لورم ایسپوم دارای استاندارد صنعتی متن ساختگی از سال میلادی زمانی که یک پرینتر ناشناخته به زحمت 1500 درحال گسترش بود می باشد '},
        {title:'لورم ایسپوم فارسی  متن ساختگی از سال میلادی زمانی که یک پرینتر ناشناخته به زحمت 1500 درحال گسترش بود می باشد '},
        {title:'لورم ایسپوم اینگلیسی متن ساختگی از سال میلادی زمانی که یک پرینتر ناشناخته به زحمت 1500 درحال گسترش بود می باشد '},
        {title:'لورم ایسپوم فارسی واینگلیسی متن ساختگی از سال میلادی زمانی که یک پرینتر ناشناخته به زحمت 1500 درحال گسترش بود می باشد '},
        {title:'لورم ایسپوم آلمانی متن ساختگی از سال میلادی زمانی که یک پرینتر ناشناخته به زحمت 1500 درحال گسترش بود می باشد '},
        {title:'لورم ایسپوم دارای استاندارد ایتالیایی متن ساختگی از سال میلادی زمانی که یک پرینتر ناشناخته به زحمت 1500 درحال گسترش بود می باشد '},

])



    return (
    <Fragment>
        <div className="w-full sm:flex-wrap flex flex-wrap  gap-7 mt-[42px]">
            {CardList.map((item,index) => {
                return(
                <CardMain  key={index} title={item.title} />
                
                )
            })}
        </div>
    </Fragment>

    )
}

export  {CardHolder}