
import React, {Fragment, useState } from 'react'
import { CardMain2 } from './CardMain2'

const Card2Holder = () => {
    const [CardList, setCardList] = useState([
        {title:'آموزش ریکت جی اس با استاد جدید ' ,desc:' این کتابخانه توسط فیسبوک و جامعه ای از توسعه دهندگان و به صورت انفرادی توسعه ونگهداری می شود  باشد ک رستگار باشید '},
        {title:'آموزش ریکت جی اس با استاد جدید ' ,desc:' این نمونه توسط فیسبوک و جامعه ای از توسعه دهندگان و به صورت انفرادی توسعه ونگهداری می شود  باشد ک رستگار باشید '},
        {title:'آموزش ریکت جی اس با استاد جدید ' ,desc:' این قسمت ازکتابخانه توسط فیسبوک و جامعه ای از توسعه دهندگان و به صورت انفرادی توسعه ونگهداری می شود  باشد ک رستگار باشید '},
        {title:' آموزش ریکت جی اس با استاد جدید ' ,desc:' این فریم ورک توسط فیسبوک و جامعه ای از توسعه دهندگان و به صورت انفرادی توسعه ونگهداری می شود  باشد ک رستگار باشید '},
        {title:'آموزش ریکت جی اس با استاد جدید ' ,desc:' این کتابخانه توسط فیسبوک و جامعه ای از توسعه دهندگان و به صورت انفرادی توسعه ونگهداری می شود  باشد ک رستگار باشید '},
        {title:'آموزش ریکت جی اس با استاد جدید ' ,desc:' این قسمت از کتابخانه توسط فیسبوک و جامعه ای از توسعه دهندگان و به صورت انفرادی توسعه ونگهداری می شود  باشد ک رستگار باشید '},

])



    return (
    <Fragment>
        <div className="w-full sm:flex-wrap flex flex-wrap  gap-7 mt-[42px] ">
            {CardList.map((item,index) => {
                return(
                <CardMain2  key={index} title={item.title} desc={item.desc} />
                
                )
            })}
        </div>
    </Fragment>

    )
}

export {Card2Holder}